---
kind: property
id: P:Autodesk.Revit.DB.ExportLinetypeInfo.DestinationLinetypeName
source: html/4b9ec47b-a645-b543-2708-bde780036b16.htm
---
# Autodesk.Revit.DB.ExportLinetypeInfo.DestinationLinetypeName Property

The destination linetype name (the name of the linetype in the exported format).

## Syntax (C#)
```csharp
public string DestinationLinetypeName { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null